Emanuel2023/EmanuelsProjects/MKL25Z4_Project_ClockModule_RV1805/source/MKL25Z4_Project_RV1805clockmodule.c
/*
 * Copyright 2016-2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/**
 * @file    MKL25Z4_Project_RV1805clockmodule.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "MKL25Z4.h"
#include "fsl_debug_console.h"
#include "fsl_i2c.h"
#include <time.h>
#include "rv_1805.h"
#include "fsl_gpio.h"

#define RV1805_ADDR                     (0x69U) // 7-bit I2C address

//===========================
// Part number
//===========================
#define RV1805_PART_NUMBER_UPPER        0x18

//===========================
// CONFKEY values
//===========================
#define RV1805_CONF_RST                 0x3C
#define RV1805_CONF_OSC                 0xA1
#define RV1805_CONF_WRT                 0x9D

//===========================
// CTRL1 bits / fields
//===========================
#define CTRL1_STOP      7
#define CTRL1_12_24     6
#define CTRL1_PSWB      5
#define CTRL1_RSTP      3
// Note: original header has "CTRL1_ARST 1 << 2". Keep the semantics:
#define CTRL1_ARST                      (1U << 2)

//===========================
// Hours register bits
//===========================
#define HOURS_AM_PM                     5

//===========================
// Trickle charge fields
//===========================
#define TRICKLE_CHARGER_TCS_OFFSET      4
#define TRICKLE_CHARGER_DIODE_OFFSET    2
#define TRICKLE_CHARGER_ROUT_OFFSET     0
#define TRICKLE_ENABLE                  0b1010
#define TRICKLE_DISABLE                 0b0000
#define DIODE_DISABLE                   0b00
#define DIODE_0_3V                      0b01
#define DIODE_0_6V                      0b10
#define ROUT_DISABLE                    0b00
#define ROUT_3K                         0b01
#define ROUT_6K                         0b10
#define ROUT_11K                        0b11

//===========================
// Interrupt Enable bits
//===========================
#define INTERRUPT_BLIE  4
#define INTERRUPT_TIE   3
#define INTERRUPT_AIE   2
#define INTERRUPT_EIE   1

//===========================
// PSW Pin Function Selection
//===========================
#define PSW_ON          false
#define PSW_OFF         true
#define PSW_UNLOCK      false
#define PSW_LOCK        true
#define PSWS_OFFSET     2
#define PSWS_INV_IRQ    0b000
#define PSWS_SQW        0b001
#define PSWS_INV_AIRQ   0b011
#define PSWS_TIRQ       0b100
#define PSWS_INV_TIRQ   0b101
#define PSWS_SLEEP      0b110
#define PSWS_STATIC     0b111

//===========================
// Countdown Timer Control
//===========================
#define COUNTDOWN_SECONDS       0b10
#define COUNTDOWN_MINUTES       0b11
#define CTDWN_TMR_TE_OFFSET     7
#define CTDWN_TMR_TM_OFFSET     6
#define CTDWN_TMR_TRPT_OFFSET   5

//===========================
// Status Bits
//===========================
#define STATUS_CB   7
#define STATUS_BAT  6
#define STATUS_WDF  5
#define STATUS_BLF  4
#define STATUS_TF   3
#define STATUS_AF   2
#define STATUS_EVF  1

//===========================
// Reference Voltage
//===========================
#define TWO_FIVE                     0x70
#define TWO_ONE                      0xB0
#define ONE_EIGHT                    0xD0
#define ONE_FOUR                     0xF0

//===========================
// Register Map
//===========================
#define RV1805_HUNDREDTHS               0x00
#define RV1805_SECONDS                  0x01
#define RV1805_MINUTES                  0x02
#define RV1805_HOURS                    0x03
#define RV1805_DATE                     0x04
#define RV1805_MONTHS                   0x05
#define RV1805_YEARS                    0x06
#define RV1805_WEEKDAYS                 0x07
#define RV1805_HUNDREDTHS_ALM           0x08
#define RV1805_SECONDS_ALM              0x09
#define RV1805_MINUTES_ALM              0x0A
#define RV1805_HOURS_ALM                0x0B
#define RV1805_DATE_ALM                 0x0C
#define RV1805_MONTHS_ALM               0x0D
#define RV1805_WEEKDAYS_ALM             0x0E
#define RV1805_STATUS                   0x0F
#define RV1805_CTRL1                    0x10
#define RV1805_CTRL2                    0x11
#define RV1805_INT_MASK                 0x12
#define RV1805_SQW                      0x13
#define RV1805_CAL_XT                   0x14
#define RV1805_CAL_RC_UP                0x15
#define RV1805_CAL_RC_LO                0x16
#define RV1805_SLP_CTRL                 0x17
#define RV1805_CTDWN_TMR_CTRL           0x18
#define RV1805_CTDWN_TMR                0x19
#define RV1805_TMR_INITIAL              0x1A
#define RV1805_WATCHDOG_TMR             0x1B
#define RV1805_OSC_CTRL                 0x1C
#define RV1805_OSC_STATUS               0x1D
#define RV1805_CONF_KEY                 0x1F
#define RV1805_TRICKLE_CHRG             0x20
#define RV1805_BREF_CTRL                0x21
#define RV1805_CAP_RC                   0x26
#define RV1805_IOBATMODE                0x27
#define RV1805_ID0                      0x28
#define RV1805_ANLG_STAT                0x2F
#define RV1805_OUT_CTRL                 0x30
#define RV1805_RAM_EXT                  0x3F

//===========================
// Time array ordering
//===========================
#define TIME_ARRAY_LENGTH 8
enum time_order {
    TIME_HUNDREDTHS = 0,
    TIME_SECONDS,     // 1
    TIME_MINUTES,     // 2
    TIME_HOURS,       // 3
    TIME_DATE,        // 4
    TIME_MONTH,       // 5
    TIME_YEAR,        // 6
    TIME_DAY          // 7
};

//===========================
// __DATE__ / __TIME__ parsing
//===========================
// <MONTH>
#define BUILD_MONTH_JAN (((__DATE__[0] == 'J') && (__DATE__[1] == 'a')) ? 1 : 0)
#define BUILD_MONTH_FEB ((__DATE__[0] == 'F') ? 2 : 0)
#define BUILD_MONTH_MAR (((__DATE__[0] == 'M') && (__DATE__[1] == 'a') && (__DATE__[2] == 'r')) ? 3 : 0)
#define BUILD_MONTH_APR (((__DATE__[0] == 'A') && (__DATE__[1] == 'p')) ? 4 : 0)
#define BUILD_MONTH_MAY (((__DATE__[0] == 'M') && (__DATE__[1] == 'a') && (__DATE__[2] == 'y')) ? 5 : 0)
#define BUILD_MONTH_JUN (((__DATE__[0] == 'J') && (__DATE__[1] == 'u') && (__DATE__[2] == 'n')) ? 6 : 0)
#define BUILD_MONTH_JUL (((__DATE__[0] == 'J') && (__DATE__[1] == 'u') && (__DATE__[2] == 'l')) ? 7 : 0)
#define BUILD_MONTH_AUG (((__DATE__[0] == 'A') && (__DATE__[1] == 'u')) ? 8 : 0)
#define BUILD_MONTH_SEP ((__DATE__[0] == 'S') ? 9 : 0)
#define BUILD_MONTH_OCT ((__DATE__[0] == 'O') ? 10 : 0)
#define BUILD_MONTH_NOV ((__DATE__[0] == 'N') ? 11 : 0)
#define BUILD_MONTH_DEC ((__DATE__[0] == 'D') ? 12 : 0)
#define BUILD_MONTH (BUILD_MONTH_JAN | BUILD_MONTH_FEB | BUILD_MONTH_MAR | \
                     BUILD_MONTH_APR | BUILD_MONTH_MAY | BUILD_MONTH_JUN | \
                     BUILD_MONTH_JUL | BUILD_MONTH_AUG | BUILD_MONTH_SEP | \
                     BUILD_MONTH_OCT | BUILD_MONTH_NOV | BUILD_MONTH_DEC)
// <DATE>
#define BUILD_DATE_0 (((__DATE__[4] == ' ') ? 0 : (__DATE__[4] - 0x30)))
#define BUILD_DATE_1 (__DATE__[5] - 0x30)
#define BUILD_DATE   ((BUILD_DATE_0 * 10) + BUILD_DATE_1)
// <YEAR>
#define BUILD_YEAR (((__DATE__[7] - 0x30) * 1000) + ((__DATE__[8] - 0x30) * 100) + \
                    ((__DATE__[9] - 0x30) * 10)  + ((__DATE__[10] - 0x30) * 1))
// <TIME>
#define BUILD_HOUR_0 (((__TIME__[0] == ' ') ? 0 : (__TIME__[0] - 0x30)))
#define BUILD_HOUR_1 (__TIME__[1] - 0x30)
#define BUILD_HOUR   ((BUILD_HOUR_0 * 10) + BUILD_HOUR_1)
#define BUILD_MINUTE_0 (((__TIME__[3] == ' ') ? 0 : (__TIME__[3] - 0x30)))
#define BUILD_MINUTE_1 (__TIME__[4] - 0x30)
#define BUILD_MINUTE   ((BUILD_MINUTE_0 * 10) + BUILD_MINUTE_1)
#define BUILD_SECOND_0 (((__TIME__[6] == ' ') ? 0 : (__TIME__[6] - 0x30)))
#define BUILD_SECOND_1 (__TIME__[7] - 0x30)
#define BUILD_SECOND   ((BUILD_SECOND_0 * 10) + BUILD_SECOND_1)

#define SEG_A     1  // PTD1
#define SEG_B     2  // PTD2
#define SEG_C     5  // PTD5
#define SEG_D     16 // PTA16
#define SEG_E     17 // PTC17
#define SEG_F     3  // PTD3
#define SEG_G     0  // PTD0
#define SEG_DP    17 // PTA17

// Define GPIO pins for digit select
#define DIGIT1    9   // PTC9
#define DIGIT2    8   // PTC8
#define DIGIT3    11  // PTC11
#define DIGIT4    10  // PTC10



//===========================
// Device context
//===========================
typedef struct {
    I2C_Type *i2c;                     // I2C base for KL25Z (e.g., I2C0)
    uint8_t  time_buf[TIME_ARRAY_LENGTH];
} rv1805_t;

//===========================
// Forward declarations (public-like API)
//===========================

// Initialization / status
bool rv1805_begin(rv1805_t *dev, I2C_Type *i2c_base);
void rv1805_reset(rv1805_t *dev);
uint8_t rv1805_status(rv1805_t *dev);

// Time handling
bool rv1805_update_time(rv1805_t *dev);
bool rv1805_set_time_full(rv1805_t *dev, uint8_t hund, uint8_t sec, uint8_t min, uint8_t hour,
                          uint8_t date, uint8_t month, uint16_t year, uint8_t day);
bool rv1805_set_time_array(rv1805_t *dev, uint8_t *time, uint8_t len);

// Individual setters
bool rv1805_set_hundredths(rv1805_t *dev, uint8_t value);
bool rv1805_set_seconds(rv1805_t *dev, uint8_t value);
bool rv1805_set_minutes(rv1805_t *dev, uint8_t value);
bool rv1805_set_hours(rv1805_t *dev, uint8_t value);
bool rv1805_set_date(rv1805_t *dev, uint8_t value);
bool rv1805_set_month(rv1805_t *dev, uint8_t value);
bool rv1805_set_year(rv1805_t *dev, uint8_t value);
bool rv1805_set_weekday(rv1805_t *dev, uint8_t value);

