Emanuel2023/EmanuelsProjects/MKL25Z4_Project_ClockModule_RV1805/source/MKL25Z4_Project_RV1805clockmodule.c
// Getters
uint8_t rv1805_get_hundredths(rv1805_t *dev);
uint8_t rv1805_get_seconds(rv1805_t *dev);
uint8_t rv1805_get_minutes(rv1805_t *dev);
uint8_t rv1805_get_hours(rv1805_t *dev);
uint8_t rv1805_get_weekday(rv1805_t *dev);
uint8_t rv1805_get_date(rv1805_t *dev);
uint8_t rv1805_get_month(rv1805_t *dev);
uint8_t rv1805_get_year(rv1805_t *dev);

// Strings / epoch
char *rv1805_string_date_usa(rv1805_t *dev);
char *rv1805_string_date(rv1805_t *dev);
char *rv1805_string_time(rv1805_t *dev);
char *rv1805_string_timestamp(rv1805_t *dev);
uint32_t rv1805_get_epoch(rv1805_t *dev);

// 12/24 hour helpers
bool rv1805_is_12hour(rv1805_t *dev);
bool rv1805_is_pm(rv1805_t *dev);
void rv1805_set_12hour(rv1805_t *dev);
void rv1805_set_24hour(rv1805_t *dev);

// Alarm
bool rv1805_set_alarm_ymdhms(rv1805_t *dev, uint8_t sec, uint8_t min, uint8_t hour, uint8_t date, uint8_t month);
bool rv1805_set_alarm_array(rv1805_t *dev, uint8_t *alarm_time, uint8_t len);
void rv1805_set_alarm_mode(rv1805_t *dev, uint8_t mode);

// Interrupts
void rv1805_enable_interrupt(rv1805_t *dev, uint8_t source);
void rv1805_disable_interrupt(rv1805_t *dev, uint8_t source);
void rv1805_clear_interrupts(rv1805_t *dev);

// Countdown timer
void rv1805_set_countdown_timer(rv1805_t *dev, uint8_t duration, uint8_t unit, bool repeat, bool pulse);

// Power / trickle / low power
void rv1805_enable_sleep(rv1805_t *dev);
void rv1805_set_power_switch_function(rv1805_t *dev, uint8_t function);
void rv1805_set_power_switch_lock(rv1805_t *dev, bool lock);
void rv1805_set_static_power_switch_output(rv1805_t *dev, bool psw);
void rv1805_enable_trickle_charge(rv1805_t *dev, uint8_t diode, uint8_t rOut);
void rv1805_disable_trickle_charge(rv1805_t *dev);
void rv1805_enable_low_power(rv1805_t *dev);

// Battery / reference voltage
void rv1805_enable_battery_interrupt(rv1805_t *dev, uint8_t voltage, bool edgeTrigger);
bool rv1805_check_battery(rv1805_t *dev, uint8_t voltage);
void rv1805_set_reference_voltage(rv1805_t *dev, uint8_t voltage);
void rv1805_set_edge_trigger(rv1805_t *dev, bool edgeTrigger);

// Compiler time
bool rv1805_set_to_compiler_time(rv1805_t *dev);

// BCD helpers
static inline uint8_t rv1805_BCD_to_DEC(uint8_t v) { return (uint8_t)((v / 0x10u) * 10u + (v % 0x10u)); }
static inline uint8_t rv1805_DEC_to_BCD(uint8_t v) { return (uint8_t)(((v / 10u) * 0x10u) + (v % 10u)); }

//===========================
// Low-level I2C helpers (MCUXpresso SDK)
//===========================
static bool rv1805_write_reg(rv1805_t *dev, uint8_t reg, uint8_t val);
static bool rv1805_write_regs(rv1805_t *dev, uint8_t reg, const uint8_t *data, size_t len);
static bool rv1805_read_reg(rv1805_t *dev, uint8_t reg, uint8_t *val);
static bool rv1805_read_regs(rv1805_t *dev, uint8_t reg, uint8_t *data, size_t len);

//===========================
// Implementation
//===========================

bool rv1805_begin(rv1805_t *dev, I2C_Type *i2c_base)
{
    if (!dev || !i2c_base) return false;
    memset(dev, 0, sizeof(*dev));
    dev->i2c = i2c_base;

    uint8_t id0 = 0xFF;
    if (!rv1805_read_reg(dev, RV1805_ID0, &id0)) return false;
    if (id0 != RV1805_PART_NUMBER_UPPER) return false;

    // Enable write to CAPRC, etc.
    if (!rv1805_write_reg(dev, RV1805_CONF_KEY, RV1805_CONF_WRT)) return false;
    if (!rv1805_write_reg(dev, RV1805_CAP_RC, 0xA0)) return false;

    // Default charger + low power
    rv1805_enable_trickle_charge(dev, DIODE_0_3V, ROUT_3K);
    rv1805_enable_low_power(dev);

    // Auto-reset interrupt flags on status read
    uint8_t ctrl1 = 0;
    rv1805_read_reg(dev, RV1805_CTRL1, &ctrl1);
    ctrl1 |= CTRL1_ARST;
    rv1805_write_reg(dev, RV1805_CTRL1, ctrl1);

    // Default to 12-hour mode (matches original)
    rv1805_set_12hour(dev);

    return true;
}

void rv1805_reset(rv1805_t *dev)
{
    if (!dev) return;
    rv1805_write_reg(dev, RV1805_CONF_KEY, RV1805_CONF_RST);
}

uint8_t rv1805_status(rv1805_t *dev)
{
    uint8_t s = 0xFF;
    if (dev) rv1805_read_reg(dev, RV1805_STATUS, &s);
    return s;
}

bool rv1805_is_12hour(rv1805_t *dev)
{
    if (!dev) return false;
    uint8_t c = 0;
    if (!rv1805_read_reg(dev, RV1805_CTRL1, &c)) return false;
    return (c & (1u << CTRL1_12_24)) != 0u;
}

bool rv1805_is_pm(rv1805_t *dev)
{
    if (!dev) return false;
    uint8_t h = 0;
    if (!rv1805_read_reg(dev, RV1805_HOURS, &h)) return false;
    return (rv1805_is_12hour(dev) && ((h & (1u << HOURS_AM_PM)) != 0u));
}

void rv1805_set_12hour(rv1805_t *dev)
{
    if (!dev) return;
    if (!rv1805_is_12hour(dev)) {
        // read current 24h hour
        uint8_t hr_bcd = 0;
        if (!rv1805_read_reg(dev, RV1805_HOURS, &hr_bcd)) return;
        uint8_t h = rv1805_BCD_to_DEC(hr_bcd);

        // set 12/24 bit
        uint8_t c1 = 0;
        rv1805_read_reg(dev, RV1805_CTRL1, &c1);
        c1 |= (1u << CTRL1_12_24);
        rv1805_write_reg(dev, RV1805_CTRL1, c1);

        bool pm = false;
        if (h == 0) h = 12;
        else if (h == 12) pm = true;
        else if (h > 12) { h -= 12; pm = true; }

        uint8_t new_hr = rv1805_DEC_to_BCD(h);
        if (pm) new_hr |= (1u << HOURS_AM_PM);
        rv1805_write_reg(dev, RV1805_HOURS, new_hr);
    }
}

void rv1805_set_24hour(rv1805_t *dev)
{
    if (!dev) return;
    if (rv1805_is_12hour(dev)) {
        uint8_t hr_bcd = 0;
        if (!rv1805_read_reg(dev, RV1805_HOURS, &hr_bcd)) return;

        bool pm = (hr_bcd & (1u << HOURS_AM_PM)) != 0u;
        hr_bcd &= ~(1u << HOURS_AM_PM);

        uint8_t c1 = 0;
        rv1805_read_reg(dev, RV1805_CTRL1, &c1);
        c1 &= ~(1u << CTRL1_12_24);
        rv1805_write_reg(dev, RV1805_CTRL1, c1);

        uint8_t h = rv1805_BCD_to_DEC(hr_bcd);
        if (pm) h += 12;
        if (h == 12) h = 0;
        if (h == 24) h = 12;

        rv1805_write_reg(dev, RV1805_HOURS, rv1805_DEC_to_BCD(h));
    }
}
bool rv1805_update_time(rv1805_t *dev)
{
    if (!dev) return false;
    if (!rv1805_read_regs(dev, RV1805_HUNDREDTHS, dev->time_buf, TIME_ARRAY_LENGTH)) return false;

    // If in 12h, remove AM/PM bit for the numeric hours in buffer (as original code did)
    if (rv1805_is_12hour(dev)) {
        dev->time_buf[TIME_HOURS] &= ~(1u << HOURS_AM_PM);
    }
    return true;
}

bool rv1805_set_time_array(rv1805_t *dev, uint8_t *time, uint8_t len)
{
    if (!dev || !time || (len != TIME_ARRAY_LENGTH)) return false;
    return rv1805_write_regs(dev, RV1805_HUNDREDTHS, time, len);
}

bool rv1805_set_time_full(rv1805_t *dev, uint8_t hund, uint8_t sec, uint8_t min, uint8_t hour,
                          uint8_t date, uint8_t month, uint16_t year, uint8_t day)
{
    if (!dev) return false;

    dev->time_buf[TIME_HUNDREDTHS] = rv1805_DEC_to_BCD(hund);
    dev->time_buf[TIME_SECONDS]    = rv1805_DEC_to_BCD(sec);
    dev->time_buf[TIME_MINUTES]    = rv1805_DEC_to_BCD(min);
    dev->time_buf[TIME_HOURS]      = rv1805_DEC_to_BCD(hour);
    dev->time_buf[TIME_DATE]       = rv1805_DEC_to_BCD(date);
    dev->time_buf[TIME_MONTH]      = rv1805_DEC_to_BCD(month);
    dev->time_buf[TIME_YEAR]       = rv1805_DEC_to_BCD((uint8_t)(year - 2000));
    dev->time_buf[TIME_DAY]        = rv1805_DEC_to_BCD(day);

    bool ok;
    if (rv1805_is_12hour(dev)) {
        rv1805_set_24hour(dev);
        ok = rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH);
        rv1805_set_12hour(dev);
    } else {
        ok = rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH);
    }
    return ok;
}

// Individual setters => update whole array (to match original behavior)
bool rv1805_set_hundredths(rv1805_t *dev, uint8_t value) { dev->time_buf[TIME_HUNDREDTHS] = rv1805_DEC_to_BCD(value); return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH); }
bool rv1805_set_seconds   (rv1805_t *dev, uint8_t value) { dev->time_buf[TIME_SECONDS]    = rv1805_DEC_to_BCD(value); return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH); }
bool rv1805_set_minutes   (rv1805_t *dev, uint8_t value) { dev->time_buf[TIME_MINUTES]    = rv1805_DEC_to_BCD(value); return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH); }
bool rv1805_set_hours     (rv1805_t *dev, uint8_t value) { dev->time_buf[TIME_HOURS]      = rv1805_DEC_to_BCD(value); return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH); }
bool rv1805_set_date      (rv1805_t *dev, uint8_t value) { dev->time_buf[TIME_DATE]       = rv1805_DEC_to_BCD(value); return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH); }
bool rv1805_set_month     (rv1805_t *dev, uint8_t value) { dev->time_buf[TIME_MONTH]      = rv1805_DEC_to_BCD(value); return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH); }
bool rv1805_set_year      (rv1805_t *dev, uint8_t value) { dev->time_buf[TIME_YEAR]       = rv1805_DEC_to_BCD(value); return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH); }
bool rv1805_set_weekday   (rv1805_t *dev, uint8_t value) { dev->time_buf[TIME_DAY]        = rv1805_DEC_to_BCD(value); return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH); }

// Getters from cached buffer (after update_time)
uint8_t rv1805_get_hundredths(rv1805_t *dev) { return rv1805_BCD_to_DEC(dev->time_buf[TIME_HUNDREDTHS]); }
uint8_t rv1805_get_seconds   (rv1805_t *dev) { return rv1805_BCD_to_DEC(dev->time_buf[TIME_SECONDS]); }
uint8_t rv1805_get_minutes   (rv1805_t *dev) { return rv1805_BCD_to_DEC(dev->time_buf[TIME_MINUTES]); }
uint8_t rv1805_get_hours     (rv1805_t *dev) { return rv1805_BCD_to_DEC(dev->time_buf[TIME_HOURS]); }
uint8_t rv1805_get_weekday   (rv1805_t *dev) { return rv1805_BCD_to_DEC(dev->time_buf[TIME_DAY]); }
uint8_t rv1805_get_date      (rv1805_t *dev) { return rv1805_BCD_to_DEC(dev->time_buf[TIME_DATE]); }
uint8_t rv1805_get_month     (rv1805_t *dev) { return rv1805_BCD_to_DEC(dev->time_buf[TIME_MONTH]); }
uint8_t rv1805_get_year      (rv1805_t *dev) { return rv1805_BCD_to_DEC(dev->time_buf[TIME_YEAR]); }

