Emanuel2023/EmanuelsProjects/MKL25Z4_Project_ClockModule_RV1805/source/MKL25Z4_Project_RV1805clockmodule.c
// String helpers (static buffers)
char *rv1805_string_date_usa(rv1805_t *dev)
{
    static char buf[11];
    sprintf(buf, "%02u/%02u/20%02u",
            rv1805_get_month(dev), rv1805_get_date(dev), rv1805_get_year(dev));
    return buf;
}
char *rv1805_string_date(rv1805_t *dev)
{
    static char buf[11];
    sprintf(buf, "%02u/%02u/20%02u",
            rv1805_get_date(dev), rv1805_get_month(dev), rv1805_get_year(dev));
    return buf;
}
char *rv1805_string_time(rv1805_t *dev)
{
    static char buf[11];
    if (rv1805_is_12hour(dev)) {
        char half = rv1805_is_pm(dev) ? 'P' : 'A';
        sprintf(buf, "%02u:%02u:%02u%cM",
                rv1805_get_hours(dev), rv1805_get_minutes(dev), rv1805_get_seconds(dev), half);
    } else {
        sprintf(buf, "%02u:%02u:%02u",
                rv1805_get_hours(dev), rv1805_get_minutes(dev), rv1805_get_seconds(dev));
    }
    return buf;
}
char *rv1805_string_timestamp(rv1805_t *dev)
{
    static char buf[23];
    sprintf(buf, "20%02u-%02u-%02uT%02u:%02u:%02u:%02u",
            rv1805_get_year(dev),
            rv1805_get_month(dev),
            rv1805_get_date(dev),
            rv1805_get_hours(dev),
            rv1805_get_minutes(dev),
            rv1805_get_seconds(dev),
            rv1805_get_hundredths(dev));
    return buf;
}

uint32_t rv1805_get_epoch(rv1805_t *dev)
{
    struct tm tmv;
    memset(&tmv, 0, sizeof(tmv));
    tmv.tm_isdst = -1;
    tmv.tm_year  = rv1805_get_year(dev) + 100;           // years since 1900
    tmv.tm_mon   = rv1805_get_month(dev) - 1;            // 0-11
    tmv.tm_mday  = rv1805_get_date(dev);
    tmv.tm_hour  = rv1805_get_hours(dev);
    tmv.tm_min   = rv1805_get_minutes(dev);
    tmv.tm_sec   = rv1805_get_seconds(dev);
    return (uint32_t)mktime(&tmv);
}

bool rv1805_set_to_compiler_time(rv1805_t *dev)
{
    if (!dev) return false;

    dev->time_buf[TIME_SECONDS] = rv1805_DEC_to_BCD(BUILD_SECOND);
    dev->time_buf[TIME_MINUTES] = rv1805_DEC_to_BCD(BUILD_MINUTE);
    dev->time_buf[TIME_HOURS]   = rv1805_DEC_to_BCD(BUILD_HOUR);

    // If 12-hour mode, convert hours and set AM/PM bit
    if (rv1805_is_12hour(dev)) {
        uint8_t hour = BUILD_HOUR;
        bool pm = false;
        if (hour == 0) hour = 12;
        else if (hour == 12) pm = true;
        else if (hour > 12) { hour -= 12; pm = true; }
        dev->time_buf[TIME_HOURS] = rv1805_DEC_to_BCD(hour);
        if (pm) dev->time_buf[TIME_HOURS] |= (1u << HOURS_AM_PM);
    }

    dev->time_buf[TIME_MONTH] = rv1805_DEC_to_BCD(BUILD_MONTH);
    dev->time_buf[TIME_DATE]  = rv1805_DEC_to_BCD(BUILD_DATE);
    dev->time_buf[TIME_YEAR]  = rv1805_DEC_to_BCD((uint8_t)(BUILD_YEAR - 2000));

    // Weekday calc (0=Sunday .. 6=Saturday), original adds +1 (1..7)
    uint16_t d = BUILD_DATE;
    uint16_t m = BUILD_MONTH;
    uint16_t y = BUILD_YEAR;
    uint16_t weekday = (d += m < 3 ? y-- : y - 2, 23 * m / 9 + d + 4 + y / 4 - y / 100 + y / 400) % 7 + 1;
    dev->time_buf[TIME_DAY] = rv1805_DEC_to_BCD((uint8_t)weekday);

    return rv1805_set_time_array(dev, dev->time_buf, TIME_ARRAY_LENGTH);
}

// Alarm
bool rv1805_set_alarm_ymdhms(rv1805_t *dev, uint8_t sec, uint8_t min, uint8_t hour, uint8_t date, uint8_t month)
{
    if (!dev) return false;
    uint8_t alarm[TIME_ARRAY_LENGTH];
    alarm[TIME_HUNDREDTHS] = rv1805_DEC_to_BCD(0);
    alarm[TIME_SECONDS]    = rv1805_DEC_to_BCD(sec);
    alarm[TIME_MINUTES]    = rv1805_DEC_to_BCD(min);
    alarm[TIME_HOURS]      = rv1805_DEC_to_BCD(hour);
    alarm[TIME_DATE]       = rv1805_DEC_to_BCD(date);
    alarm[TIME_MONTH]      = rv1805_DEC_to_BCD(month);
    alarm[TIME_YEAR]       = rv1805_DEC_to_BCD(0);
    alarm[TIME_DAY]        = rv1805_DEC_to_BCD(0);
    return rv1805_set_alarm_array(dev, alarm, TIME_ARRAY_LENGTH);
}
bool rv1805_set_alarm_array(rv1805_t *dev, uint8_t *alarm_time, uint8_t len)
{
    if (!dev || !alarm_time || len != TIME_ARRAY_LENGTH) return false;
    return rv1805_write_regs(dev, RV1805_HUNDREDTHS_ALM, alarm_time, TIME_ARRAY_LENGTH);
}

void rv1805_set_alarm_mode(rv1805_t *dev, uint8_t mode)
{
    if (!dev) return;
    if (mode > 0b111) mode = 0b111;
    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_CTDWN_TMR_CTRL, &v);
    v &= 0b11100011;           // clear ARPT bits
    v |= (uint8_t)(mode << 2); // set ARPT (alarm repeat/match fields)
    rv1805_write_reg(dev, RV1805_CTDWN_TMR_CTRL, v);
}

// Interrupts
void rv1805_enable_interrupt(rv1805_t *dev, uint8_t source)
{
    if (!dev) return;
    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_INT_MASK, &v);
    v |= (uint8_t)(1u << source);
    rv1805_write_reg(dev, RV1805_INT_MASK, v);
}
void rv1805_disable_interrupt(rv1805_t *dev, uint8_t source)
{
    if (!dev) return;
    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_INT_MASK, &v);
    v &= (uint8_t)~(1u << source);
    rv1805_write_reg(dev, RV1805_INT_MASK, v);
}
void rv1805_clear_interrupts(rv1805_t *dev)
{
    (void)rv1805_status(dev); // reading STATUS clears flags (with ARST set)
}

// Countdown timer
void rv1805_set_countdown_timer(rv1805_t *dev, uint8_t duration, uint8_t unit, bool repeat, bool pulse)
{
    if (!dev) return;
    if ((duration == 0) || (unit > 0b11)) return;

    rv1805_write_reg(dev, RV1805_CTDWN_TMR, (uint8_t)(duration - 1));
    rv1805_write_reg(dev, RV1805_TMR_INITIAL, (uint8_t)(duration - 1));

    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_CTDWN_TMR_CTRL, &v);
    v &= 0b00011100; // preserve ARPT bits only (upper fields cleared)
    v |= unit;
    v |= (uint8_t)((!pulse) << CTDWN_TMR_TM_OFFSET);
    v |= (uint8_t)((repeat) << CTDWN_TMR_TRPT_OFFSET);
    v |= (uint8_t)(1u << CTDWN_TMR_TE_OFFSET);
    rv1805_write_reg(dev, RV1805_CTDWN_TMR_CTRL, v);
}

// Power / trickle / low power
void rv1805_enable_sleep(rv1805_t *dev)
{
    if (!dev) return;
    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_SLP_CTRL, &v);
    v |= (1u << 7);
    rv1805_write_reg(dev, RV1805_SLP_CTRL, v);
}
void rv1805_set_power_switch_function(rv1805_t *dev, uint8_t function)
{
    if (!dev) return;
    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_CTRL2, &v);
    v &= 0b11000011;                     // clear PSWS bits
    v |= (uint8_t)(function << PSWS_OFFSET);
    rv1805_write_reg(dev, RV1805_CTRL2, v);
}
void rv1805_set_power_switch_lock(rv1805_t *dev, bool lock)
{
    if (!dev) return;
    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_OSC_STATUS, &v);
    v &= (uint8_t)~(1u << 5);
    v |= (uint8_t)((lock ? 1u : 0u) << 5);
    rv1805_write_reg(dev, RV1805_OSC_STATUS, v);
}
void rv1805_set_static_power_switch_output(rv1805_t *dev, bool psw)
{
    if (!dev) return;
    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_CTRL1, &v);
    v &= (uint8_t)~(1u << CTRL1_PSWB);
    v |= (uint8_t)((psw ? 1u : 0u) << CTRL1_PSWB);
    rv1805_write_reg(dev, RV1805_CTRL1, v);
}
void rv1805_enable_trickle_charge(rv1805_t *dev, uint8_t diode, uint8_t rOut)
{
    if (!dev) return;
    rv1805_write_reg(dev, RV1805_CONF_KEY, RV1805_CONF_WRT);
    uint8_t v = 0;
    v |= (uint8_t)(TRICKLE_ENABLE << TRICKLE_CHARGER_TCS_OFFSET);
    v |= (uint8_t)(diode          << TRICKLE_CHARGER_DIODE_OFFSET);
    v |= (uint8_t)(rOut           << TRICKLE_CHARGER_ROUT_OFFSET);
    rv1805_write_reg(dev, RV1805_TRICKLE_CHRG, v);
}
void rv1805_disable_trickle_charge(rv1805_t *dev)
{
    if (!dev) return;
    rv1805_write_reg(dev, RV1805_CONF_KEY, RV1805_CONF_WRT);
    rv1805_write_reg(dev, RV1805_TRICKLE_CHRG, (uint8_t)(TRICKLE_DISABLE << TRICKLE_CHARGER_TCS_OFFSET));
}
void rv1805_enable_low_power(rv1805_t *dev)
{
    if (!dev) return;

    rv1805_write_reg(dev, RV1805_CONF_KEY, RV1805_CONF_WRT);
    rv1805_write_reg(dev, RV1805_IOBATMODE, 0x00); // Disable I2C on backup power

    rv1805_write_reg(dev, RV1805_CONF_KEY, RV1805_CONF_WRT);
    rv1805_write_reg(dev, RV1805_OUT_CTRL, 0x30);  // Disable WDI, etc.

    rv1805_write_reg(dev, RV1805_CONF_KEY, RV1805_CONF_OSC);
    rv1805_write_reg(dev, RV1805_OSC_CTRL, 0b11111100); // OSEL=1, ACAL=11, BOS=1, FOS=1, IOPW=1, OFIE=0, ACIE=0

