Emanuel2023/EmanuelsProjects/MKL25Z4_Project_ClockModule_RV1805/source/MKL25Z4_Project_RV1805clockmodule.c
    uint8_t c1 = 0;
    rv1805_read_reg(dev, RV1805_CTRL1, &c1);
    c1 |= (1u << CTRL1_RSTP);              // set reset pin high
    rv1805_write_reg(dev, RV1805_CTRL1, c1);

    rv1805_set_power_switch_lock(dev, PSW_UNLOCK);
    rv1805_set_static_power_switch_output(dev, PSW_OFF);

    // RC oscillator usage / auto calibration comments preserved from original
}

// Battery / reference voltage
void rv1805_enable_battery_interrupt(rv1805_t *dev, uint8_t voltage, bool edgeTrigger)
{
    if (!dev) return;
    rv1805_set_edge_trigger(dev, edgeTrigger);
    rv1805_enable_interrupt(dev, INTERRUPT_BLIE);
    rv1805_set_reference_voltage(dev, voltage);
}

bool rv1805_check_battery(rv1805_t *dev, uint8_t voltage)
{
    if (!dev) return false;
    rv1805_set_reference_voltage(dev, voltage);
    uint8_t s = 0;
    rv1805_read_reg(dev, RV1805_ANLG_STAT, &s);
    return (s >= 0x80);
}

void rv1805_set_reference_voltage(rv1805_t *dev, uint8_t voltage)
{
    if (!dev) return;
    if (voltage > 3) voltage = 3;
    uint8_t v = TWO_FIVE;
    switch (voltage) {
        case 0: v = TWO_FIVE;  break;
        case 1: v = TWO_ONE;   break;
        case 2: v = ONE_EIGHT; break;
        case 3: v = ONE_FOUR;  break;
        default: break;
    }
    rv1805_write_reg(dev, RV1805_CONF_KEY, RV1805_CONF_WRT);
    rv1805_write_reg(dev, RV1805_BREF_CTRL, v);
}

void rv1805_set_edge_trigger(rv1805_t *dev, bool edgeTrigger)
{
    if (!dev) return;
    uint8_t v = 0;
    rv1805_read_reg(dev, RV1805_RAM_EXT, &v);
    v &= (uint8_t)~(1u << 6); // Clear BPOL
    v |= (uint8_t)((edgeTrigger ? 1u : 0u) << 6);
    rv1805_write_reg(dev, RV1805_RAM_EXT, v);
}

//===========================
// Low-level I2C helpers (blocking) using NXP SDK
//===========================
static bool rv1805_write_reg(rv1805_t *dev, uint8_t reg, uint8_t val)
{
    uint8_t buf[2] = { reg, val };
    i2c_master_transfer_t xfer = {
        .flags = kI2C_TransferDefaultFlag,
        .slaveAddress = RV1805_ADDR,
        .direction = kI2C_Write,
        .subaddress = 0,
        .subaddressSize = 0,
        .data = buf,
        .dataSize = sizeof(buf)
    };
    return (I2C_MasterTransferBlocking(dev->i2c, &xfer) == kStatus_Success);
}

static bool rv1805_write_regs(rv1805_t *dev, uint8_t reg, const uint8_t *data, size_t len)
{
    uint8_t tmp[1 + 32];
    if (len > 32) return false; // adjust as needed; split if required
    tmp[0] = reg;
    memcpy(&tmp[1], data, len);

    i2c_master_transfer_t xfer = {
        .flags = kI2C_TransferDefaultFlag,
        .slaveAddress = RV1805_ADDR,
        .direction = kI2C_Write,
        .subaddress = 0,
        .subaddressSize = 0,
        .data = tmp,
        .dataSize = (uint32_t)(1 + len)
    };
    return (I2C_MasterTransferBlocking(dev->i2c, &xfer) == kStatus_Success);
}
static bool rv1805_read_reg(rv1805_t *dev, uint8_t reg, uint8_t *val)
{
    i2c_master_transfer_t xfer = {
        .flags = kI2C_TransferDefaultFlag,
        .slaveAddress = RV1805_ADDR,
        .direction = kI2C_Write,
        .subaddress = 0,
        .subaddressSize = 0,
        .data = &reg,
        .dataSize = 1
    };
    if (I2C_MasterTransferBlocking(dev->i2c, &xfer) != kStatus_Success) return false;

    i2c_master_transfer_t rx = {
        .flags = kI2C_TransferDefaultFlag,
        .slaveAddress = RV1805_ADDR,
        .direction = kI2C_Read,
        .subaddress = 0,
        .subaddressSize = 0,
        .data = val,
        .dataSize = 1
    };
    return (I2C_MasterTransferBlocking(dev->i2c, &rx) == kStatus_Success);
}

static bool rv1805_read_regs(rv1805_t *dev, uint8_t reg, uint8_t *data, size_t len)
{
    i2c_master_transfer_t w = {
        .flags = kI2C_TransferDefaultFlag,
        .slaveAddress = RV1805_ADDR,
        .direction = kI2C_Write,
        .subaddress = 0,
        .subaddressSize = 0,
        .data = &reg,
        .dataSize = 1
    };
    if (I2C_MasterTransferBlocking(dev->i2c, &w) != kStatus_Success) return false;

    i2c_master_transfer_t r = {
        .flags = kI2C_TransferDefaultFlag,
        .slaveAddress = RV1805_ADDR,
        .direction = kI2C_Read,
        .subaddress = 0,
        .subaddressSize = 0,
        .data = data,
        .dataSize = (uint32_t)len
    };
    return (I2C_MasterTransferBlocking(dev->i2c, &r) == kStatus_Success);
}

static void delay_ms(uint32_t ms)
{
    // Assuming a 48MHz core clock. Adjust as needed.
    volatile uint32_t cycles = ms * 48000U;
    while (cycles--) { __NOP(); }
}



//void init_gpio(void);
//void enable_digit(uint8_t digit);
//
//void init_gpio(void) {
//    // Enable clocks
//    SIM->SCGC5 |= SIM_SCGC5_PORTA_MASK | SIM_SCGC5_PORTC_MASK | SIM_SCGC5_PORTD_MASK;
//
//    // Segment pins
//    PORTD->PCR[SEG_A] = PORT_PCR_MUX(1); // PTD1
//    PORTD->PCR[SEG_B] = PORT_PCR_MUX(1); // PTD2
//    PORTD->PCR[SEG_C] = PORT_PCR_MUX(1); // PTD5
//    PORTD->PCR[SEG_F] = PORT_PCR_MUX(1); // PTD3
//    PORTD->PCR[SEG_G] = PORT_PCR_MUX(1); // PTD0
//    PORTA->PCR[SEG_D] = PORT_PCR_MUX(1); // PTA16
//    PORTC->PCR[SEG_E] = PORT_PCR_MUX(1); // PTC17
//    PORTA->PCR[SEG_DP] = PORT_PCR_MUX(1); // PTA17
//
//    // Digit select pins
//    PORTC->PCR[DIGIT1] = PORT_PCR_MUX(1); // PTC9
//    PORTC->PCR[DIGIT2] = PORT_PCR_MUX(1); // PTC8
//    PORTC->PCR[DIGIT3] = PORT_PCR_MUX(1); // PTC11
//    PORTC->PCR[DIGIT4] = PORT_PCR_MUX(1); // PTC10
//
//    // Set all as output
//    GPIOD->PDDR |= (1 << SEG_A) | (1 << SEG_B) | (1 << SEG_C) | (1 << SEG_F) | (1 << SEG_G);
//    GPIOA->PDDR |= (1 << SEG_D) | (1 << SEG_DP);
//    GPIOC->PDDR |= (1 << SEG_E) | (1 << DIGIT1) | (1 << DIGIT2) | (1 << DIGIT3) | (1 << DIGIT4);
//}
//const uint8_t digit_segments[10] = {
//    0b00111111, // 0 = A B C D E F
//    0b00000110, // 1 = B C
//    0b01011011, // 2 = A B G E D
//    0b01001111, // 3 = A B C D G
//    0b01100110, // 4 = F G B C
//    0b01101101, // 5 = A F G C D
//    0b01111101, // 6 = A F G C D E
//    0b00000111, // 7 = A B C
//    0b01111111, // 8 = All segments
//    0b01101111  // 9 = A B C D F G
//};
//
//void display_digit(uint8_t num) {
//    // Clear all segments first
//    GPIOD->PCOR = (1 << SEG_A) | (1 << SEG_B) | (1 << SEG_C) | (1 << SEG_F) | (1 << SEG_G);
//    GPIOA->PCOR = (1 << SEG_D) | (1 << SEG_DP);
//    GPIOC->PCOR = (1 << SEG_E);
//
//    uint8_t seg = digit_segments[num % 10];  // safeguard if num > 9
//
//    if (seg & (1 << 0)) GPIOD->PSOR |= (1 << SEG_A);
//    if (seg & (1 << 1)) GPIOD->PSOR |= (1 << SEG_B);
//    if (seg & (1 << 2)) GPIOD->PSOR |= (1 << SEG_C);
//    if (seg & (1 << 3)) GPIOA->PSOR |= (1 << SEG_D);
//    if (seg & (1 << 4)) GPIOC->PSOR |= (1 << SEG_E);
//    if (seg & (1 << 5)) GPIOD->PSOR |= (1 << SEG_F);
//    if (seg & (1 << 6)) GPIOD->PSOR |= (1 << SEG_G);
//}
//
//void enable_digit(uint8_t digit) {
//    // Turn off all digits first
//    GPIOC->PSOR = (1 << DIGIT1) | (1 << DIGIT2) | (1 << DIGIT3) | (1 << DIGIT4);
//
//    // Turn on the selected digit
//    switch (digit) {
//        case 0: GPIOC->PCOR = (1 << DIGIT1); break;
//        case 1: GPIOC->PCOR = (1 << DIGIT2); break;
//        case 2: GPIOC->PCOR = (1 << DIGIT3); break;
//        case 3: GPIOC->PCOR = (1 << DIGIT4); break;
//    }
//}
//
//
//int main(void) {
//    BOARD_InitBootPins();
//    BOARD_InitBootClocks();
//    BOARD_InitDebugConsole();
//
//    init_gpio();
//
//    // Initialize I2C, RV1805 device
//    rv1805_t rv1805_dev;
//    if (!rv1805_begin(&rv1805_dev, RV1805_I2C_BASE)) {
//        PRINTF("RV1805 initialization failed!\r\n");
//        while (1);  // Halt
//    }
//
//    // Optionally set time here (e.g., to compiler time)
//    rv1805_set_to_compiler_time(&rv1805_dev);
//
//    while (1) {
//        // Update time from RTC
//        if (rv1805_update_time(&rv1805_dev)) {
//            // Extract digits for HH:MM display
//            uint8_t digits[4];
//            digits[0] = rv1805_get_hours(&rv1805_dev) / 10;
//            digits[1] = rv1805_get_hours(&rv1805_dev) % 10;
//            digits[2] = rv1805_get_minutes(&rv1805_dev) / 10;
//            digits[3] = rv1805_get_minutes(&rv1805_dev) % 10;
//
//            // Multiplex display for a short period (e.g., 5ms each digit)
//            for (int i = 0; i < 4; i++) {
//                display_digit(digits[i]);
//                enable_digit(i);
//                delay_ms(1);
//            }
//        } else {
//            PRINTF("Failed to update time from RV1805.\r\n");
//            delay_ms(20);  // Wait a bit before retry
//        }
//    }
//
//    return 0;
//}


//
//const uint8_t digit_segments[10] = {
//    0b00111111, // 0 = A B C D E F
//    0b00000110, // 1 = B C
//    0b01011011, // 2 = A B G E D
//    0b01001111, // 3 = A B C D G
//    0b01100110, // 4 = F G B C
//    0b01101101, // 5 = A F G C D
//    0b01111101, // 6 = A F G C D E
//    0b00000111, // 7 = A B C
//    0b01111111, // 8 = All
//    0b01101111  // 9 = A B C D F G
//};
//
//void display_digit(uint8_t num) {
//    // Clear all segments
//    GPIOD->PCOR = (1 << SEG_A) | (1 << SEG_B) | (1 << SEG_C) |
//                  (1 << SEG_F) | (1 << SEG_G);
//    GPIOA->PCOR = (1 << SEG_D) | (1 << SEG_DP);
//    GPIOC->PCOR = (1 << SEG_E);
//
//    uint8_t seg = digit_segments[num % 10];  // safety
//
//    if (seg & (1 << 0)) GPIOD->PSOR |= (1 << SEG_A);
//    if (seg & (1 << 1)) GPIOD->PSOR |= (1 << SEG_B);
//    if (seg & (1 << 2)) GPIOD->PSOR |= (1 << SEG_C);
//    if (seg & (1 << 3)) GPIOA->PSOR |= (1 << SEG_D);
//    if (seg & (1 << 4)) GPIOC->PSOR |= (1 << SEG_E);
//    if (seg & (1 << 5)) GPIOD->PSOR |= (1 << SEG_F);
//    if (seg & (1 << 6)) GPIOD->PSOR |= (1 << SEG_G);
//}
//void enable_digit(uint8_t digit) {
//    // Turn off all digits first
//    GPIOC->PSOR = (1 << DIGIT1) | (1 << DIGIT2) | (1 << DIGIT3) | (1 << DIGIT4);
//
//    // Enable only the selected digit (active low or high depending on your hardware)
//    switch(digit) {
//        case 0: GPIOC->PCOR = (1 << DIGIT1); break;
//        case 1: GPIOC->PCOR = (1 << DIGIT2); break;
//        case 2: GPIOC->PCOR = (1 << DIGIT3); break;
//        case 3: GPIOC->PCOR = (1 << DIGIT4); break;
//        default: break;
//    }
//}
//
//int main(void) {
//    init_gpio();
//    RV1805_t rtc;
//    RV1805_begin(&rtc, I2C0);
//
//    uint8_t digits[4] = {0, 0, 0, 0};
//    uint32_t counter = 0;
//
//    while (1) {
//        // Refresh display via multiplexing
//        for (int i = 0; i < 4; i++) {
//            display_digit(digits[i]);
//            enable_digit(i);
//            delay_ms(1);
//        }
//
//        // Update time every ~1000 iterations (~1s)
//        if (++counter >= 1000) {
//            counter = 0;
//            RV1805_updateTime(&rtc);
//            uint8_t hours = RV1805_getHours(&rtc);
//            uint8_t mins = RV1805_getMinutes(&rtc);
//
//            // Convert to individual digits
//            digits[0] = hours / 10;
//            digits[1] = hours % 10;
//            digits[2] = mins / 10;
//            digits[3] = mins % 10;
//        }
//    }
//}










