Emanuel2023/EmanuelsProjects/MKL25Z4_Project_ClockModule_RV1805/source/MKL25Z4_Project_RV1805clockmodule.c
//int main(void)
//{
//    // -------------------------
//    // Board / clocks / pins
//    // -------------------------
//    BOARD_InitBootPins();
//    BOARD_InitBootClocks();
//    BOARD_InitDebugConsole(); // enables PRINTF()
//
//    PRINTF("\r\nKL25Z + RV1805 demo\r\n");
//
//    // -------------------------
//    // I2C init
//    // -------------------------
//    i2c_master_config_t i2cConfig;
//    I2C_MasterGetDefaultConfig(&i2cConfig);
//    // Assuming RV1805_I2C_BAUD is defined elsewhere, e.g., in board.h or rv_1805.h
//    // For example: #define RV1805_I2C_BAUD 100000U
//    i2cConfig.baudRate_Bps = RV1805_I2C_BAUD;
//
//    // KL25Z bus clock drives I2C0
//    uint32_t i2cClockHz = CLOCK_GetFreq(kCLOCK_BusClk);
//    I2C_MasterInit(RV1805_I2C_BASE, &i2cConfig, i2cClockHz);
//
//    // -------------------------
//    // RV1805 init
//    // -------------------------
//    rv1805_t rv1805_dev; // Declare the RV1805 device context
//
//    // Try to begin communication with the RV1805
//    if (!rv1805_begin(&rv1805_dev, RV1805_I2C_BASE))
//    {
//        PRINTF("RV1805 initialization failed! Please check wiring and I2C address.\r\n");
//        while (1) { /* Halt on error */ }
//    }
//    PRINTF("RV1805 initialized successfully.\r\n");
//
//    // Set the RTC time to the compiler's build time
//    if (!rv1805_set_to_compiler_time(&rv1805_dev))
//    {
//        PRINTF("Failed to set RV1805 time to compiler time.\r\n");
//    }
//    else
//    {
//        PRINTF("RV1805 time set to compiler time.\r\n");
//    }
//
//    // Main loop to continuously read and print the time
//    while (1)
//    {
//        if (rv1805_update_time(&rv1805_dev))
//        {
//            PRINTF("Current Time: %s %s (Weekday: %u, Epoch: %lu)\r\n",
//                   rv1805_string_date_usa(&rv1805_dev),
//                   rv1805_string_time(&rv1805_dev),
//                   rv1805_get_weekday(&rv1805_dev),
//                   rv1805_get_epoch(&rv1805_dev));
//        }
//        else
//        {
//            PRINTF("Failed to read time from RV1805.\r\n");
//        }
//
//        delay_ms(1000); // Delay for 1 second before reading again
//    }
//
//    return 0;
//
//}











int main(void)
{
    // -------------------------
    // Board / clocks / pins
    // -------------------------
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitDebugConsole(); // enables PRINTF()

    PRINTF("\r\nKL25Z + RV1805 demo\r\n");

    // -------------------------
    // I2C init
    // -------------------------
    i2c_master_config_t i2cConfig;
    I2C_MasterGetDefaultConfig(&i2cConfig);
    // Assuming RV1805_I2C_BAUD is defined elsewhere, e.g., in board.h or rv_1805.h
    // For example: #define RV1805_I2C_BAUD 100000U
    i2cConfig.baudRate_Bps = RV1805_I2C_BAUD;

    // KL25Z bus clock drives I2C0
    uint32_t i2cClockHz = CLOCK_GetFreq(kCLOCK_BusClk);
    I2C_MasterInit(RV1805_I2C_BASE, &i2cConfig, i2cClockHz);

    // -------------------------
    // RV1805 init
    // -------------------------
    rv1805_t rv1805_dev; // Declare the RV1805 device context

    // Try to begin communication with the RV1805
    if (!rv1805_begin(&rv1805_dev, RV1805_I2C_BASE))
    {
        PRINTF("RV1805 initialization failed! Please check wiring and I2C address.\r\n");
        while (1) { /* Halt on error */ }
    }
    PRINTF("RV1805 initialized successfully.\r\n");

    // Set the RTC time to the compiler's build time
    if (!rv1805_set_to_compiler_time(&rv1805_dev))
    {
        PRINTF("Failed to set RV1805 time to compiler time.\r\n");
    }
    else
    {
        PRINTF("RV1805 time set to compiler time.\r\n");
    }

    // Main loop to continuously read and print the time
    while (1)
    {
        if (rv1805_update_time(&rv1805_dev))
        {
            PRINTF("Current Time: %s %s (Weekday: %u, Epoch: %lu)\r\n",
                   rv1805_string_date_usa(&rv1805_dev),
                   rv1805_string_time(&rv1805_dev),
                   rv1805_get_weekday(&rv1805_dev),
                   rv1805_get_epoch(&rv1805_dev));
        }
        else
        {
            PRINTF("Failed to read time from RV1805.\r\n");
        }

        delay_ms(1000); // Delay for 1 second before reading again
    }

    return 0;
}

